[
  {
    "date": "2020/05/30",
    "summary": [
      "Revamped the Required Loot Items page"
    ],
    "changes": [
      "Required loot items are now split up better and display the required amounts for individual tasks and hideout modules."
    ]
  },
  {
    "date": "2020/05/29",
    "summary": [
      "Updated ammo for patch 12.6",
      "Updated required loot items for tasks for patch 12.6"
    ],
    "changes": [
      "Ammo values have been updated (all .366 rounds got a damage nerf)",
      "Required loot items for tasks have been updated. Lots of items were changed to be found in raid, but have had their quantities reduced."
    ]
  },
  {
    "date": "2020/05/26",
    "summary": [
      "Overhaul of Keys page",
      "There is now locations for both spawn locations and use locations for keys and maps",
      "Added support for keys that have spawns/use on multiple maps (eg: Factory Key)"
    ],
    "changes": [
      "Can now toggle between the spawn locations and key use locations on the Keys page.",
      "Can toggle between maps if a key spawns on multiple maps or can be used on multiple maps.",
      "Added a few new spawn locations for keys (Labs Red Keycard, RB-ORB1, & RB-ORB2).",
      "Screenshots of key use locations will be added in the near future."
    ]
  },
  {
    "date": "2020/04/12",
    "summary": [
      "Added new map for Labs"
    ],
    "changes": [
      "Added new custom map for Labs. Updated all extraction and key data for Labs"
    ]
  },
  {
    "date": "2020/03/18",
    "summary": [
      "Updated ammo scatter plot chart",
      "Added new maps for Interchange and Factory",
      "Added ULTRA Medical Storage Key"
    ],
    "changes": [
      "Scatter plot chart has been update. The axis have been flipped, damage is now on the bottom (x-axis) and penetration on the left (y-axis)",
      "Added visual breakpoints on the chart for armor and health (only showing head and thorax HP as they are the important ones)",
      "Added new custom made maps for Interchange and Factory. I hope to keep making these and will focus on ones that don't have good maps available (Labs and Reserve are priority)",
      "Added ULTRA Medical Storage Key"
    ]
  },
  {
    "date": "2020/03/12",
    "summary": [
      "Added new Interchange extractions",
      "Added new Interchange Keycards",
      "Updated ammo"
    ],
    "changes": [
      "Added new Interchange extractions (Scav Camp, Hole In Fence, and Saferoom Exfil)",
      "Added new Interchange Keycards (Object #21WS and Object #11SR)",
      "Update ammo (5.7x28 mm SS190: Damage: 57 -> 49, Penetration: 32 -> 37)"
    ]
  },
  {
    "date": "2020/03/09",
    "summary": [
      "Added some missing keys",
      "Update game version"
    ],
    "changes": [
      "Added Shturman Key",
      "Added USEC Stash on Customs Key",
      "Added Key to HEP Station Storage"
    ]
  },
  {
    "date": "2020/02/09",
    "summary": [
      "Added screenshots for all extraction points",
      "Updated screenshots for some key spawns"
    ],
    "changes": [
      "Factory, Interchange, Customs, Shoreline, Woods, and Labs now have screenshots for all extraction points.",
      "Fixed and updated details for several extractions",
      "Update screenshot for Idea Cash Register key.",
      "Update screenshot for ZB-014 key.",
      "Update screenshot for Oli Logistics Dept Office key."
    ]
  },
  {
    "date": "2020/02/02",
    "summary": [
      "Full app rewrite, lots of changes"
    ],
    "changes": [
      "Added dark mode/light mode toggle",
      "Update ammo spreadsheet, header is now fixed",
      "Update ammo scatter plot chart. Can now hover to preview calibre values",
      "Removed Content Creators page",
      "Removed Checklist page",
      "Added Required Items page",
      "Added more items to the More Resources page",
      "Full rewrite, lots of improvements across the app"
    ]
  },
  {
    "date": "2019/12/30",
    "summary": [
      "Update ammo values & spreadsheet"
    ],
    "changes": [
      "Updated all ammo values",
      "Update spreadsheet component"
    ]
  },
  {
    "date": "2019/11/08",
    "summary": [
      "Added all known spawns for Reserve keys",
      "Updated some prices on the item values table"
    ],
    "changes": [
      "All known key spawns for the Reserve keys are now marked, with screenshots and video.",
      "The prices for the following items were updated/added: Bitcoin, Broken GPhone, Electric Drill, Fuel Conditioner, Gunpowder (Kite, Hawk & Eagle), Morphone, Elite Pliers, Long Flat Screwdriver, PSU, Wires, Silencerco Hybrid 46 Suppressor, Holosun HS401G5 Reflex Sight, Powercord, Broken LCD, Pile of Meds, Silicone Tube, Analog Thermometer, Capacitors, NIXXOR Lens, Lightbulb, Disposable Syringe, Water Filter, Akali, IFAK, Radiator Helix."
    ]
  },
  {
    "date": "2019/10/27",
    "summary": ["Lots of updates for patch 0.12"],
    "changes": [
      "Updated ammo",
      "Added Reserve extractions with images",
      "Added RB-AM Military Base Key",
      "Updated Interchange extract names",
      "Improved compression of key spawn images and moved them to a CDN"
    ]
  },
  {
    "date": "2019/09/15",
    "summary": ["Added Map Extractions page."],
    "changes": [
      "Added the map extractions page with all extracts for each map.",
      "Works the same as the Key Spawn maps. Search by extract name or by map."
    ]
  },
  {
    "date": "2019/09/01",
    "summary": [
      "Added screenshots & videos for Health Resort Utility Room Key and Labs Blue Keycard location #2.",
      "Updated screenshots & videos for Office 112 Key, East Wing 328 & 226 Key, and West Wing 203 Key.",
      "Fix Dorm Room 214 Key description."
    ],
    "changes": [
      "Added screenshot and video for Health Resort Utility Room Key. This was missed in the initial update.",
      "Added screenshot and video for Labs Blue Keycard location #2.",
      "Updated screenshot and video for Office 112 Key.",
      "Updated screenshot and video for East Wing 328 & 226 Key",
      "Updated screenshot and video for West Wing 203 Key.",
      "Fix Dorm Room 214 Key description."
    ]
  },
  {
    "date": "2019/08/04",
    "summary": [
      "Added screenshots and video guides for almost all key spawn locations",
      "Added 'Item Values' page. A searchable table featuring values & value per slot of barter items"
    ],
    "changes": [
      "Added screenshots and video guides for almost all key spawn locations. Some screenshots & videos missing due to not having the required keys to access spawn locations",
      "Will be continually updating these screenshots & videos to try and get key spawns in each one",
      "Added 'Item Values' page. A searchable table featuring values & value per slot of barter items",
      "Modified the 'Updates' dashboard card, and added this changelog list"
    ]
  }
]
