[
  {
    "date": "2021/01/27",
    "summary": [
      "Updated ammo values"
    ],
    "changes": [
      "Updated ammo values"
    ]
  },
  {
    "date": "2020/12/30",
    "summary": [
      "*NEW - Updated Flea Market API to be more efficient",
      "*NEW - Updated Woods map",
      "*NEW - Added 19 new caches on Woods",
      "*NEW - Updated Customs map",
      "Added new ammo (.300 & .338)",
      "Added new Woods extractions (Bridge Extraction, Northern UN Roadblock, Eastern Rocks, Scav Bridge)",
      "Removed Cliff Descent extraction",
      "Added 3 new caches on Customs",
      "Updated some required task items",
      "Expect frequent updates over the next couple days with the new patch"
    ],
    "changes": [
      "Updated Flea Market API to be more efficient. Also started tracking how many times items are searched for daily",
      "Updated the Woods map with the new expansion",
      "Added new Woods extractions. Removed Cliff Descent extraction",
      "Added 14 new caches on Woods",
      "Updated Customs map. Added basement for Warehouse 4. Added interiors for Fortress",
      "Added 3 new Caches to Customs",
      "Updated ammo. Added new .300 & .338 ammo",
      "Updated some required task items"
    ]
  },
  {
    "date": "2020/12/05",
    "summary": [
      "Added new Customs map",
      "Added cardinal direction to maps (Factory, Interchange, Woods)",
      "Flipped Woods map to match cardinal directions"
    ],
    "changes": [
      "Updated most maps with cardinal directions now that the compass is in the game.",
      "Woods was flipped to match the cardinal directions",
      "Woods has some extract names that now conflict with the in game cardinal directions"
    ]
  },
  {
    "date": "2020/11/29",
    "summary": [
      "Added cache locations maps"
    ],
    "changes": [
      "Added the Caches page. View maps of all caches on the maps that have them."
    ]
  },
  {
    "date": "2020/10/03",
    "summary": [
      "Added Flea Market Prices"
    ],
    "changes": [
      "Added the Flea Market Prices page. You can search for any item and get up to date prices.",
      "Data provided by Tarkov-Market"
    ]
  },
  {
    "date": "2020/08/23",
    "summary": [
      "Added ZB-013 extract on Customs",
      "Added screenshot for D-2 extract"
    ],
    "changes": [
      "Added ZB-013 extract on Customs",
      "Added screenshot for D-2 extract"
    ]
  },
  {
    "date": "2020/07/25",
    "summary": [
      "Updated ammo, several new rounds were added",
      "Added 2 new keys",
      "Updated thorax health to 85 on scatter plot breakpoints"
    ],
    "changes": [
      "New ammo: 9x19 mm QuakeMaker, 9x19 mm 7N31, .45 ACP Hydr-Shock, .45 ACP Lasermatch FMJ, .45 ACP AP, .366 AP, 7.62x51 mm M993",
      "Added new keys that are found on the Shoreline scav boss Sanitar: Key Card With a Strip of Duct Tape & Key With Tape",
      "Thorax health was changed from 80 to 85"
    ]
  },
  {
    "date": "2020/06/30",
    "summary": [
      "Updated Reserve map, added underground area",
      "Added 2 new Reserve keys",
      "Added new Reserve extract",
      "Updated ammo"
    ],
    "changes": [
      "Reserve map was updated with the new underground area",
      "Added the key use locations for the 3 new reserve keys",
      "Added the new Reserve extract location"
    ]
  },
  {
    "date": "2020/06/25",
    "summary": [
      "Updated ammo values",
      "Added ability to view detailed ammo value changes when there have been updates to ammo",
      "Added toggle switch on ammo chart to show or hide all calibers"
    ],
    "changes": [
      "Ammo data was updated, changes to .366",
      "You can now view exactly what ammo data has been changed when ammo gets updated. See the 'CLICK HERE TO VIEW RECENT AMMO CHANGES' button on the Ammo page",
      "Toggling the 'Show All Calibers' switch on the ammo chart will show or hide all ammo on the chart, so you can easily hide everything and select only the caliber you want."
    ]
  },
  {
    "date": "2020/06/16",
    "summary": [
      "Updated Task and Hideout required items list"
    ],
    "changes": [
      "Updated Task and Hideout required items list.",
      "Was missing the Fishing Place task and the new items for the Collector task.",
      "Some item quantities were incorrect as well. Those have been fixed."
    ]
  },
  {
    "date": "2020/06/15",
    "summary": [
      "Updated a few key spawns, lock locations, and extracts."
    ],
    "changes": [
      "Updated image for Armored Train extract.",
      "Updated lock location for RB-MP11 key",
      "Added new spawn for Dorm Room 214 key",
      "Added images for RB-ORB1 and RB-ORB2 spawns",
      "Added image for one of Labs Red Keycard spawn",
      "Small update to Reserve map"
    ]
  },
  {
    "date": "2020/06/06",
    "summary": [
      "New map for Woods!"
    ],
    "changes": [
      "Added the new map for Woods."
    ]
  },
  {
    "date": "2020/06/01",
    "summary": [
      "New map for Reserve!",
      "Added EFTFG Map files to the 'More Resources' page"
    ],
    "changes": [
      "Added the new map for Reserve.",
      "All EFTFG maps are now available on the 'More Resources' page. Feel free to save them."
    ]
  },
  {
    "date": "2020/05/30",
    "summary": [
      "Revamped the Required Loot Items page"
    ],
    "changes": [
      "Required loot items are now split up better and display the required amounts for individual tasks and hideout modules."
    ]
  },
  {
    "date": "2020/05/29",
    "summary": [
      "Updated ammo for patch 12.6",
      "Updated required loot items for tasks for patch 12.6"
    ],
    "changes": [
      "Ammo values have been updated (all .366 rounds got a damage nerf)",
      "Required loot items for tasks have been updated. Lots of items were changed to be found in raid, but have had their quantities reduced."
    ]
  },
  {
    "date": "2020/05/26",
    "summary": [
      "Overhaul of Keys page",
      "There is now locations for both spawn locations and use locations for keys and maps",
      "Added support for keys that have spawns/use on multiple maps (eg: Factory Key)"
    ],
    "changes": [
      "Can now toggle between the spawn locations and key use locations on the Keys page.",
      "Can toggle between maps if a key spawns on multiple maps or can be used on multiple maps.",
      "Added a few new spawn locations for keys (Labs Red Keycard, RB-ORB1, & RB-ORB2).",
      "Screenshots of key use locations will be added in the near future."
    ]
  },
  {
    "date": "2020/04/12",
    "summary": [
      "Added new map for Labs"
    ],
    "changes": [
      "Added new custom map for Labs. Updated all extraction and key data for Labs"
    ]
  },
  {
    "date": "2020/03/18",
    "summary": [
      "Updated ammo scatter plot chart",
      "Added new maps for Interchange and Factory",
      "Added ULTRA Medical Storage Key"
    ],
    "changes": [
      "Scatter plot chart has been update. The axis have been flipped, damage is now on the bottom (x-axis) and penetration on the left (y-axis)",
      "Added visual breakpoints on the chart for armor and health (only showing head and thorax HP as they are the important ones)",
      "Added new custom made maps for Interchange and Factory. I hope to keep making these and will focus on ones that don't have good maps available (Labs and Reserve are priority)",
      "Added ULTRA Medical Storage Key"
    ]
  },
  {
    "date": "2020/03/12",
    "summary": [
      "Added new Interchange extractions",
      "Added new Interchange Keycards",
      "Updated ammo"
    ],
    "changes": [
      "Added new Interchange extractions (Scav Camp, Hole In Fence, and Saferoom Exfil)",
      "Added new Interchange Keycards (Object #21WS and Object #11SR)",
      "Update ammo (5.7x28 mm SS190: Damage: 57 -> 49, Penetration: 32 -> 37)"
    ]
  },
  {
    "date": "2020/03/09",
    "summary": [
      "Added some missing keys",
      "Update game version"
    ],
    "changes": [
      "Added Shturman Key",
      "Added USEC Stash on Customs Key",
      "Added Key to HEP Station Storage"
    ]
  },
  {
    "date": "2020/02/09",
    "summary": [
      "Added screenshots for all extraction points",
      "Updated screenshots for some key spawns"
    ],
    "changes": [
      "Factory, Interchange, Customs, Shoreline, Woods, and Labs now have screenshots for all extraction points.",
      "Fixed and updated details for several extractions",
      "Update screenshot for Idea Cash Register key.",
      "Update screenshot for ZB-014 key.",
      "Update screenshot for Oli Logistics Dept Office key."
    ]
  },
  {
    "date": "2020/02/02",
    "summary": [
      "Full app rewrite, lots of changes"
    ],
    "changes": [
      "Added dark mode/light mode toggle",
      "Update ammo spreadsheet, header is now fixed",
      "Update ammo scatter plot chart. Can now hover to preview calibre values",
      "Removed Content Creators page",
      "Removed Checklist page",
      "Added Required Items page",
      "Added more items to the More Resources page",
      "Full rewrite, lots of improvements across the app"
    ]
  },
  {
    "date": "2019/12/30",
    "summary": [
      "Update ammo values & spreadsheet"
    ],
    "changes": [
      "Updated all ammo values",
      "Update spreadsheet component"
    ]
  },
  {
    "date": "2019/11/08",
    "summary": [
      "Added all known spawns for Reserve keys",
      "Updated some prices on the item values table"
    ],
    "changes": [
      "All known key spawns for the Reserve keys are now marked, with screenshots and video.",
      "The prices for the following items were updated/added: Bitcoin, Broken GPhone, Electric Drill, Fuel Conditioner, Gunpowder (Kite, Hawk & Eagle), Morphone, Elite Pliers, Long Flat Screwdriver, PSU, Wires, Silencerco Hybrid 46 Suppressor, Holosun HS401G5 Reflex Sight, Powercord, Broken LCD, Pile of Meds, Silicone Tube, Analog Thermometer, Capacitors, NIXXOR Lens, Lightbulb, Disposable Syringe, Water Filter, Akali, IFAK, Radiator Helix."
    ]
  },
  {
    "date": "2019/10/27",
    "summary": ["Lots of updates for patch 0.12"],
    "changes": [
      "Updated ammo",
      "Added Reserve extractions with images",
      "Added RB-AM Military Base Key",
      "Updated Interchange extract names",
      "Improved compression of key spawn images and moved them to a CDN"
    ]
  },
  {
    "date": "2019/09/15",
    "summary": ["Added Map Extractions page."],
    "changes": [
      "Added the map extractions page with all extracts for each map.",
      "Works the same as the Key Spawn maps. Search by extract name or by map."
    ]
  },
  {
    "date": "2019/09/01",
    "summary": [
      "Added screenshots & videos for Health Resort Utility Room Key and Labs Blue Keycard location #2.",
      "Updated screenshots & videos for Office 112 Key, East Wing 328 & 226 Key, and West Wing 203 Key.",
      "Fix Dorm Room 214 Key description."
    ],
    "changes": [
      "Added screenshot and video for Health Resort Utility Room Key. This was missed in the initial update.",
      "Added screenshot and video for Labs Blue Keycard location #2.",
      "Updated screenshot and video for Office 112 Key.",
      "Updated screenshot and video for East Wing 328 & 226 Key",
      "Updated screenshot and video for West Wing 203 Key.",
      "Fix Dorm Room 214 Key description."
    ]
  },
  {
    "date": "2019/08/04",
    "summary": [
      "Added screenshots and video guides for almost all key spawn locations",
      "Added 'Item Values' page. A searchable table featuring values & value per slot of barter items"
    ],
    "changes": [
      "Added screenshots and video guides for almost all key spawn locations. Some screenshots & videos missing due to not having the required keys to access spawn locations",
      "Will be continually updating these screenshots & videos to try and get key spawns in each one",
      "Added 'Item Values' page. A searchable table featuring values & value per slot of barter items",
      "Modified the 'Updates' dashboard card, and added this changelog list"
    ]
  }
]
